---

C#Visual BasicVisual C++

Revit 2024 API
---
PDFExportOptions..::..Combine Property
PDFExportOptions Class See Also Send Feedback
---

Whether export all views and sheets into one PDF file or multiple files.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022

# Syntax

C#
---

    public bool Combine { get; set; }

Visual Basic
---

    Public Property Combine As Boolean
    	Get
    	Set

Visual C++
---

    public:
    property bool Combine {
    	bool get ();
    	void set (bool value);
    }

# Remarks

If trueTruetruetrue (True in Visual Basic), all exported views and sheets will be exported into one PDF file, whose file name would be specified by FileName. If falseFalsefalsefalse (False in Visual Basic), each exported view and sheet will have its own PDF file created, whose file name would be generated with [!:NamingRule].

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace